---
kind: method
id: M:Autodesk.Revit.DB.Electrical.AreaBasedLoadData.RemoveElectricalLoadArea(Autodesk.Revit.DB.ElementId)
source: html/826066f6-c600-9c31-ab8a-340f1f02b8ae.htm
---
# Autodesk.Revit.DB.Electrical.AreaBasedLoadData.RemoveElectricalLoadArea Method

Removes electrical load area from the area based load.

## Syntax (C#)
```csharp
public void RemoveElectricalLoadArea(
	ElementId electricalLoadAreaId
)
```

## Parameters
- **electricalLoadAreaId** (`Autodesk.Revit.DB.ElementId`) - The electrical load area id to remove.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null